{
  "Name": "Granby Colleges of Science and Technology",
  "Lessons": [
    {
      "Title": "History and Founding",
      "Topics": [
        {
          "Title": "Original Name of the Institution",
          "Content": "The original name of Granby Colleges of Science and Technology was Granby Computer School."
        },
        {
          "Title": "Founders of the Institution",
          "Content": "The founders of Granby Colleges of Science and Technology were Overseas Filipino Workers (OFWs)."
        },
        {
          "Title": "Founders' Work During Gulf War",
          "Content": "During the Gulf War, the founders worked in the Middle East. Their primary source of income was a T-shirt printing business."
        },
        {
          "Title": "Business Dealings Leading to Name",
          "Content": "Granby Colleges of Science and Technology acquired its name from business dealings with British troops."
        }
      ]
    },
    {
      "Title": "Institutional Achievements and Approvals",
      "Topics": [
        {
          "Title": "Government Agency Approvals",
          "Content": "The programs offered by Granby Colleges of Science and Technology were approved by the Commission on Higher Education (CHED) and the Technical Education and Skills Development Authority (TESDA)."
        },
        {
          "Title": "First Degree Course Approved by CHED",
          "Content": "The first degree course approved by CHED for Granby Colleges of Science and Technology was the Bachelor of Science in Business Administration."
        },
        {
          "Title": "Number of Incorporators Required by SEC",
          "Content": "The Securities and Exchange Commission (SEC) requires five incorporators for a corporation like Granby Colleges of Science and Technology."
        },
        {
          "Title": "Significant Achievement with CHED, TESDA, and DepEd",
          "Content": "Granby Colleges of Science and Technology achieved significant approval from CHED, TESDA, and the Department of Education (DepEd)."
        },
        {
          "Title": "Location of the Institution",
          "Content": "Granby Colleges of Science and Technology is located in the town of Naic."
        }
      ]
    },
    {
      "Title": "Founders' Background and Support",
      "Topics": [
        {
          "Title": "Founder's Occupation Before Establishing the Institution",
          "Content": "Before establishing Granby Colleges of Science and Technology, the founder was a farmer."
        },
        {
          "Title": "Founder's Request During College",
          "Content": "While still studying, the founder requested the college administration to start an Adult Education project."
        },
        {
          "Title": "Supporters of the Founder's Idea",
          "Content": "The founder's idea of establishing an educational institution was supported by two best friends and colleagues: an OFW friend and a co-educator friend."
        }
      ]
    },
    {
      "Title": "Educational Programs and Challenges",
      "Topics": [
        {
          "Title": "First TESDA Approved Course",
          "Content": "The first course approved by TESDA for Granby Computer Center was a Computer Programming course."
        },
        {
          "Title": "Event Leading to Relocation",
          "Content": "Granby Learning Center had to look for another space due to a deal with the building owner being pirated."
        },
        {
          "Title": "Initial Rental of Buildings",
          "Content": "Granby Learning Center initially rented three buildings."
        },
        {
          "Title": "Reason for Loan Application",
          "Content": "Granby College of Science and Technology applied for a loan due to the need for more space."
        },
        {
          "Title": "Financing Building Improvements",
          "Content": "To finance the improvement of its building, Granby College of Science and Technology sold a piece of land."
        },
        {
          "Title": "Department of Education's Plan",
          "Content": "A revision to the K-to-12 program by the Department of Education led Granby to apply for a government permit."
        }
      ]
    },
    {
      "Title": "Business Evolution and Military Operations",
      "Topics": [
        {
          "Title": "Founders' Original Business Venture",
          "Content": "The founders' original business venture in the Middle East was T-shirt printing."
        },
        {
          "Title": "Military Operation During Gulf War",
          "Content": "The military operation that provided income for the founders during the Gulf War was Desert Shield and Desert Storm."
        },
        {
          "Title": "Business Evolution in Saudi Arabia",
          "Content": "Granby Saudi Arabia evolved from T-shirt printing to computer sales and tutorial lessons."
        }
      ]
    },
    {
      "Title": "Changes and Suggestions by Government Agencies",
      "Topics": [
        {
          "Title": "CHED's Suggestion for Name Change",
          "Content": "CHED suggested changing the term 'College' to 'Colleges' in the name of Granby College of Science and Technology."
        },
        {
          "Title": "TESDA's Suggestion for Legal Status",
          "Content": "TESDA suggested changing the legal status of Granby Computer School to a Corporation."
        },
        {
          "Title": "Initial Educational Programs Offered",
          "Content": "Granby Computer School initially offered technical and vocational courses."
        },
        {
          "Title": "Achievement with Department of Education",
          "Content": "Granby College of Science and Technology achieved approval of the K-to-12 Basic Education Program with the Department of Education."
        },
        {
          "Title": "Motivation for Establishing a Business in the Philippines",
          "Content": "The primary motivation for the founders to establish a business in the Philippines was future planning after leaving Saudi Arabia."
        },
        {
          "Title": "CHED's Suggested Change for Granby College",
          "Content": "CHED suggested changing the term 'College' to 'Colleges' in the name of Granby College of Science and Technology."
        }
      ]
    }
  ]
}
